In [1]:
import numpy as np

from pandas import Series,DataFrame

import pandas as pd

In [2]:
ser= Series(np.arange(3),index=['A','V','D'])
ser

A    0
V    1
D    2
dtype: int64

In [3]:
ser.drop('V')

A    0
D    2
dtype: int64

In [4]:
dframe = DataFrame(np.arange(9).reshape((3,3)),index=['a','d','g'],columns=['pop','olo','klk'])

In [5]:
dframe

   pop  olo  klk
a    0    1    2
d    3    4    5
g    6    7    8

In [6]:
dframe.drop('d')

   pop  olo  klk
a    0    1    2
g    6    7    8

In [7]:
dframe

   pop  olo  klk
a    0    1    2
d    3    4    5
g    6    7    8

In [8]:
dekh=dframe.drop('d')

In [9]:
dekh

   pop  olo  klk
a    0    1    2
g    6    7    8

In [10]:
dframe.drop('olo',axis=1)

   pop  klk
a    0    2
d    3    5
g    6    8

In [11]:
ser1 = Series(np.arange(3),index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int64

In [12]:
ser= 2*ser1

In [13]:
ser

A    0
B    2
C    4
dtype: int64

In [14]:
ser[1:3]

B    2
C    4
dtype: int64

In [15]:
ser[ser>3]

C    4
dtype: int64

In [16]:
ser[ser>3]= 85

In [17]:
ser

A     0
B     2
C    85
dtype: int64

In [19]:
dframe1 = DataFrame(np.arange(25).reshape((5,5)),index=['a','d','g','o','la'],columns=['pop','olo','klk','ghg','ere'])

In [24]:
 dframe1

    pop  olo  klk  ghg  ere
a     0    1    2    3    4
d     5    6    7    8    9
g    10   11   12   13   14
o    15   16   17   18   19
la   20   21   22   23   24

In [34]:
dframe1[dframe1['klk'] > 10]

    pop  olo  klk  ghg  ere
g    10   11   12   13   14
o    15   16   17   18   19
la   20   21   22   23   24

In [35]:
dframe1 > 12

      pop    olo    klk    ghg    ere
a   False  False  False  False  False
d   False  False  False  False  False
g   False  False  False   True   True
o    True   True   True   True   True
la   True   True   True   True   True

In [41]:
a= list('ABHFKSmlmalcC')

In [42]:
a

['A', 'B', 'H', 'F', 'K', 'S', 'm', 'l', 'm', 'a', 'l', 'c', 'C']